const int led = 2;
const int mic = 3;
const int matrixport = 4;

//-слэш - разрез /слэш в гору \слэш с горы
//Маркеры памяти
//void - пустота - космос - ничего - не использует память
//int  - интеджер - целое - память для чисел 12345
//char - символы - буквы
//long - для всего
//------setup - Название
//------() - круглые скобки (SHIFT+9, SHIFT+0) настройки
//------{} - фигурные скобки (SHIFT+Х, SHIFT+Ъ) Начало и конец
//Сложных приказов

// Способности
// Играть музыку

void much_mus(){// измерение музыки;
 
}

void light_pixel(){ // зажечь пиксель
  
}  

void light_stolbs(){//зажечь столбики
      
}
//-----------------------------------------------------------------
const int MIC = 0;  // выход усилителя сигнала с микрофона подключён к контакту A0
int adc;
int dB, PdB;  // в этих переменных будут храниться рассчитанные значения децибел
//---------------------------------------------------------------------------------------

void setup(){
  int s=0

}
void loop(){
//  измерение
  if  (s==1){
    
  }
//  работа
  if (s==2)  {
    
  }
//  разряжен 
  if (s==3)  {
    
  }
  
